org/keystore.org
#+TITLE: 从pem文件生成keystore和truststore文件

* 生成密钥文件(server1.kp12)
#+BEGIN_EXAMPLE
[root@redhat keys]# openssl pkcs12 -export -in cert.pem -inkey key.pem -out server1.kp12 -name server1
Enter pass phrase for key.pem:
Enter Export Password:
Verifying - Enter Export Password:
#+END_EXAMPLE

* 生成keystore文件(keystore)
#+BEGIN_EXAMPLE
[root@redhat keys]# keytool -importkeystore -deststorepass keystore -destkeypass keystore -destkeystore keystore -srckeystore server1.pk12 -srcstoretype PKCS12 -srcstorepass '' -alias server1
#+END_EXAMPLE

* 从keystore文件中导出证书文件(server1.cer)
#+BEGIN_EXAMPLE
[root@redhat keys]# keytool -exportcert -alias webapi --keystore keystore -rfc -file server1.cer
Enter keystore password:
Certificate stored in file <server1.cer>
#+END_EXAMPLE

* 将证书文件(webapi.cer)导入到truststore文件(truststore)
#+BEGIN_EXAMPLE
[root@redhat keys]# keytool -importcert -alias webapi -file server1.cer -keystore truststore
Enter keystore password:
Re-enter new password:
Owner: CN=192.168.137.231, O=Default Company Ltd, ST=shanxi, C=CH
Issuer: CN=192.168.137.231, O=Default Company Ltd, L=xian, ST=shanxi, C=CH
Serial number: 0
Valid from: Tue Nov 03 23:30:56 CST 2015 until: Wed Nov 02 23:30:56 CST 2016
Certificate fingerprints:
         MD5:  9C:10:B7:40:4D:68:78:EE:71:FD:C5:2F:32:5A:72:AD
         SHA1: 12:EE:35:54:90:B5:35:A2:E8:87:3A:1F:B9:5A:4E:07:5C:2D:02:F7
         SHA256: FB:C1:47:B8:CE:6A:B2:39:A5:65:A6:31:1A:22:E8:0C:AF:F2:FE:18:7D:2A:C5:F5:F1:0A:7C:36:B1:89:4E:7E
         Signature algorithm name: SHA1withRSA
         Version: 3

Extensions:

#1: ObjectId: 2.16.840.1.113730.1.13 Criticality=false
0000: 16 1D 4F 70 65 6E 53 53   4C 20 47 65 6E 65 72 61  ..OpenSSL Genera
0010: 74 65 64 20 43 65 72 74   69 66 69 63 61 74 65     ted Certificate


#2: ObjectId: 2.5.29.35 Criticality=false
AuthorityKeyIdentifier [
KeyIdentifier [
0000: 2B AF 4E 64 70 09 77 98   E8 A0 CC 82 43 BA 58 56  +.Ndp.w.....C.XV
0010: 26 03 5A 44                                        &.ZD
]
]

#3: ObjectId: 2.5.29.19 Criticality=false
BasicConstraints:[
  CA:false
  PathLen: undefined
]

#4: ObjectId: 2.5.29.14 Criticality=false
SubjectKeyIdentifier [
KeyIdentifier [
0000: B4 E9 FC 57 17 96 0D EB   60 3A C5 FD 7B FC 33 B2  ...W....`:....3.
0010: 61 FD 62 CD                                        a.b.
]
]

Trust this certificate? [no]:  yes
Certificate was added to keystore
#+END_EXAMPLE
