keystore.html
<!DOCTYPE html>
<html>
<head>
<title>从pem文件生成keystore和truststore文件</title>
<!-- 2015-11-03 火 17:34 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Chen Guangqi">
</head>
<body>
<div id="content">
<h1 class="title">从pem文件生成keystore和truststore文件</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">生成密钥文件(server1.kp12)</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
[root@redhat keys]# openssl pkcs12 -export -in cert.pem -inkey key.pem -out server1.kp12 -name server1
Enter pass phrase for key.pem:
Enter Export Password:
Verifying - Enter Export Password:
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">生成keystore文件(keystore)</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
[root@redhat keys]# keytool -importkeystore -deststorepass keystore -destkeypass keystore -destkeystore keystore -srckeystore server1.pk12 -srcstoretype PKCS12 -srcstorepass '' -alias server1
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">从keystore文件中导出证书文件(server1.cer)</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
[root@redhat keys]# keytool -exportcert -alias webapi --keystore keystore -rfc -file server1.cer
Enter keystore password:
Certificate stored in file &lt;server1.cer&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">将证书文件(webapi.cer)导入到truststore文件(truststore)</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
[root@redhat keys]# keytool -importcert -alias webapi -file server1.cer -keystore truststore
Enter keystore password:
Re-enter new password:
Owner: CN=192.168.137.231, O=Default Company Ltd, ST=shanxi, C=CH
Issuer: CN=192.168.137.231, O=Default Company Ltd, L=xian, ST=shanxi, C=CH
Serial number: 0
Valid from: Tue Nov 03 23:30:56 CST 2015 until: Wed Nov 02 23:30:56 CST 2016
Certificate fingerprints:
         MD5:  9C:10:B7:40:4D:68:78:EE:71:FD:C5:2F:32:5A:72:AD
         SHA1: 12:EE:35:54:90:B5:35:A2:E8:87:3A:1F:B9:5A:4E:07:5C:2D:02:F7
         SHA256: FB:C1:47:B8:CE:6A:B2:39:A5:65:A6:31:1A:22:E8:0C:AF:F2:FE:18:7D:2A:C5:F5:F1:0A:7C:36:B1:89:4E:7E
         Signature algorithm name: SHA1withRSA
         Version: 3

Extensions:

#1: ObjectId: 2.16.840.1.113730.1.13 Criticality=false
0000: 16 1D 4F 70 65 6E 53 53   4C 20 47 65 6E 65 72 61  ..OpenSSL Genera
0010: 74 65 64 20 43 65 72 74   69 66 69 63 61 74 65     ted Certificate


#2: ObjectId: 2.5.29.35 Criticality=false
AuthorityKeyIdentifier [
KeyIdentifier [
0000: 2B AF 4E 64 70 09 77 98   E8 A0 CC 82 43 BA 58 56  +.Ndp.w.....C.XV
0010: 26 03 5A 44                                        &amp;.ZD
]
]

#3: ObjectId: 2.5.29.19 Criticality=false
BasicConstraints:[
  CA:false
  PathLen: undefined
]

#4: ObjectId: 2.5.29.14 Criticality=false
SubjectKeyIdentifier [
KeyIdentifier [
0000: B4 E9 FC 57 17 96 0D EB   60 3A C5 FD 7B FC 33 B2  ...W....`:....3.
0010: 61 FD 62 CD                                        a.b.
]
]

Trust this certificate? [no]:  yes
Certificate was added to keystore
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: Chen Guangqi</p>
<p class="date">Created: 2015-11-03 火 17:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
